{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_image": {"name": "input_image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "input_label": {"name": "input_label:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "11"}]}}}, "outputs": {"Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "20"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "20"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "28"}, {"size": "28"}]}}}}, "modelTopology": {"node": [{"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.concat_6/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "784"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.concat_7/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.compat.v1.transpose_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_28/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.concat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_label", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "11"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_28/tf.compat.v1.transpose_2/transpose", "op": "Transpose", "input": ["input_image", "PartitionedCall/model_28/tf.compat.v1.transpose_2/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "-8"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.cast/Cast", "op": "Cast", "input": ["input_label"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_28/flatten_2/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_28/tf.compat.v1.transpose_2/transpose", "PartitionedCall/model_28/flatten_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_28/flatten_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_28/tf.cast/Cast", "PartitionedCall/model_28/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_28/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_28/tf.cast/Cast", "PartitionedCall/model_28/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_28/tf.__operators__.add_3/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/flatten_2/Reshape", "unknown_3", "unknown_7"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "784"}]}, {"dim": [{"size": "784"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.__operators__.add_2/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/flatten_1/Reshape", "unknown_22", "unknown_26"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "11"}]}, {"dim": [{"size": "11"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.__operators__.add_1/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/flatten/Reshape", "unknown_2", "unknown_6"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "11"}]}, {"dim": [{"size": "11"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.concat_1/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_28/tf.__operators__.add_3/AddV2", "PartitionedCall/model_28/tf.__operators__.add_1/AddV2", "PartitionedCall/model_28/tf.concat_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_28/tf.nn.relu_2/Relu", "op": "Relu", "input": ["PartitionedCall/model_28/tf.concat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.nn.relu_3/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_2/Relu", "unknown_8", "unknown_10"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "800"}]}, {"dim": [{"size": "800"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.nn.relu_4/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_3/Relu", "unknown_11", "unknown_13"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/output_mu/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_4/Relu", "unknown_18", "unknown_20"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "20"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/output_logstd/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_4/Relu", "unknown_14", "unknown_16"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "20"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/model_28/output_mu/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.math.multiply_9/Mul", "op": "Mul", "input": ["PartitionedCall/model_28/output_logstd/AddV2", "unknown_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/model_28/output_logstd/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.math.exp/Exp", "op": "Exp", "input": ["PartitionedCall/model_28/tf.math.multiply_9/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.math.multiply_12/Mul", "op": "Mul", "input": ["unknown_21", "PartitionedCall/model_28/tf.math.exp/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_28/output_mu/AddV2", "PartitionedCall/model_28/tf.math.multiply_12/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.__operators__.add_8/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.math.add/Add", "unknown_23", "unknown_27"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "20"}]}, {"dim": [{"size": "20"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.concat_6/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_28/tf.__operators__.add_8/AddV2", "PartitionedCall/model_28/tf.__operators__.add_2/AddV2", "PartitionedCall/model_28/tf.concat_6/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_28/tf.nn.relu_5/Relu", "op": "Relu", "input": ["PartitionedCall/model_28/tf.concat_6/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.nn.relu_6/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_5/Relu", "unknown_28", "unknown_30"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "800"}]}, {"dim": [{"size": "800"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.nn.relu_7/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_6/Relu", "unknown_31", "unknown_33"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.__operators__.add_11/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_28/tf.nn.relu_7/Relu", "unknown_34", "unknown_36"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "784"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_28/tf.reshape_28/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_28/tf.__operators__.add_11/AddV2", "PartitionedCall/model_28/tf.concat_7/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_28/output_image/Sigmoid", "op": "Sigmoid", "input": ["PartitionedCall/model_28/tf.reshape_28/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_28/output_image/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "unknown_21", "shape": [1, 20], "dtype": "float32"}, {"name": "unknown_17", "shape": [], "dtype": "float32"}, {"name": "unknown_23", "shape": [20, 400], "dtype": "float32"}, {"name": "unknown_27", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_28/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_22", "shape": [11, 400], "dtype": "float32"}, {"name": "unknown_26", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_28/tf.concat_6/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_28", "shape": [800, 400], "dtype": "float32"}, {"name": "unknown_30", "shape": [400], "dtype": "float32"}, {"name": "unknown_31", "shape": [400, 400], "dtype": "float32"}, {"name": "unknown_33", "shape": [400], "dtype": "float32"}, {"name": "unknown_34", "shape": [400, 784], "dtype": "float32"}, {"name": "unknown_36", "shape": [784], "dtype": "float32"}, {"name": "PartitionedCall/model_28/tf.concat_7/concat", "shape": [4], "dtype": "int32"}, {"name": "unknown_18", "shape": [400, 20], "dtype": "float32"}, {"name": "unknown_20", "shape": [20], "dtype": "float32"}, {"name": "PartitionedCall/model_28/tf.compat.v1.transpose_2/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/model_28/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_3", "shape": [784, 400], "dtype": "float32"}, {"name": "unknown_7", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_28/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_2", "shape": [11, 400], "dtype": "float32"}, {"name": "unknown_6", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_28/tf.concat_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_8", "shape": [800, 400], "dtype": "float32"}, {"name": "unknown_10", "shape": [400], "dtype": "float32"}, {"name": "unknown_11", "shape": [400, 400], "dtype": "float32"}, {"name": "unknown_13", "shape": [400], "dtype": "float32"}, {"name": "unknown_14", "shape": [400, 20], "dtype": "float32"}, {"name": "unknown_16", "shape": [20], "dtype": "float32"}]}]}