{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_image": {"name": "input_image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "input_label": {"name": "input_label:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "11"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "20"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "20"}]}}}}, "modelTopology": {"node": [{"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.compat.v1.transpose_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_25/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.concat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_label", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "11"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_25/tf.compat.v1.transpose_2/transpose", "op": "Transpose", "input": ["input_image", "PartitionedCall/model_25/tf.compat.v1.transpose_2/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "-5"}, {"size": "-6"}, {"size": "-7"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.cast/Cast", "op": "Cast", "input": ["input_label"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_25/flatten_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_25/tf.compat.v1.transpose_2/transpose", "PartitionedCall/model_25/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_25/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_25/tf.cast/Cast", "PartitionedCall/model_25/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_25/tf.__operators__.add_2/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_25/flatten_1/Reshape", "unknown_3", "unknown_7"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "784"}]}, {"dim": [{"size": "784"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.__operators__.add_1/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_25/flatten/Reshape", "unknown_2", "unknown_6"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "11"}]}, {"dim": [{"size": "11"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.concat_1/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_25/tf.__operators__.add_2/AddV2", "PartitionedCall/model_25/tf.__operators__.add_1/AddV2", "PartitionedCall/model_25/tf.concat_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_25/tf.nn.relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/model_25/tf.concat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.nn.relu_2/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_25/tf.nn.relu_1/Relu", "unknown_8", "unknown_10"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "800"}]}, {"dim": [{"size": "800"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/tf.nn.relu_3/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_25/tf.nn.relu_2/Relu", "unknown_11", "unknown_13"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/output_logstd/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_25/tf.nn.relu_3/Relu", "unknown_14", "unknown_18"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "20"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_25/output_mu/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_25/tf.nn.relu_3/Relu", "unknown_15", "unknown_19"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "20"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/model_25/output_logstd/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_25/output_mu/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_15", "shape": [400, 20], "dtype": "float32"}, {"name": "unknown_19", "shape": [20], "dtype": "float32"}, {"name": "PartitionedCall/model_25/tf.compat.v1.transpose_2/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/model_25/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_3", "shape": [784, 400], "dtype": "float32"}, {"name": "unknown_7", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_25/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_2", "shape": [11, 400], "dtype": "float32"}, {"name": "unknown_6", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_25/tf.concat_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_8", "shape": [800, 400], "dtype": "float32"}, {"name": "unknown_10", "shape": [400], "dtype": "float32"}, {"name": "unknown_11", "shape": [400, 400], "dtype": "float32"}, {"name": "unknown_13", "shape": [400], "dtype": "float32"}, {"name": "unknown_14", "shape": [400, 20], "dtype": "float32"}, {"name": "unknown_18", "shape": [20], "dtype": "float32"}]}]}