{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_label": {"name": "input_label:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "11"}]}}, "input_latent": {"name": "input_latent:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "20"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "28"}, {"size": "28"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_2/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.concat_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "784"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.concat_4/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "input_label", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "11"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "input_latent", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "20"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.cast/Cast", "op": "Cast", "input": ["input_label"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_2/flatten/Reshape", "op": "Reshape", "input": ["input_latent", "PartitionedCall/model_2/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/flatten_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.cast/Cast", "PartitionedCall/model_2/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.__operators__.add/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/flatten/Reshape", "unknown_0", "unknown_4"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "20"}]}, {"dim": [{"size": "20"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.__operators__.add_1/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/flatten_1/Reshape", "unknown", "unknown_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "11"}]}, {"dim": [{"size": "11"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.concat_3/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_2/tf.__operators__.add/AddV2", "PartitionedCall/model_2/tf.__operators__.add_1/AddV2", "PartitionedCall/model_2/tf.concat_3/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_2/tf.concat_3/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.nn.relu_2/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/tf.nn.relu/Relu", "unknown_5", "unknown_7"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "800"}]}, {"dim": [{"size": "800"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.nn.relu_3/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/tf.nn.relu_2/Relu", "unknown_8", "unknown_10"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "400"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.__operators__.add_4/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/tf.nn.relu_3/Relu", "unknown_11", "unknown_13"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "400"}]}, {"dim": [{"size": "400"}, {"size": "784"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.reshape_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.__operators__.add_4/AddV2", "PartitionedCall/model_2/tf.concat_4/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_2/output_image/Sigmoid", "op": "Sigmoid", "input": ["PartitionedCall/model_2/tf.reshape_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_2/output_image/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/model_2/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_0", "shape": [20, 400], "dtype": "float32"}, {"name": "unknown_4", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_2/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [11, 400], "dtype": "float32"}, {"name": "unknown_3", "shape": [400], "dtype": "float32"}, {"name": "PartitionedCall/model_2/tf.concat_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_5", "shape": [800, 400], "dtype": "float32"}, {"name": "unknown_7", "shape": [400], "dtype": "float32"}, {"name": "unknown_8", "shape": [400, 400], "dtype": "float32"}, {"name": "unknown_10", "shape": [400], "dtype": "float32"}, {"name": "unknown_11", "shape": [400, 784], "dtype": "float32"}, {"name": "unknown_13", "shape": [784], "dtype": "float32"}, {"name": "PartitionedCall/model_2/tf.concat_4/concat", "shape": [4], "dtype": "int32"}]}]}